app/controllers/posts_controller.rb

  def index
    @posts = Post.order('created_at DESC')
    @rows = [[]]
    @posts.each do |post|
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["body", ""], ["image", nil], ["created_at", "2022-12-26 00:00:41.011488"], ["updated_at", "2022-12-26 00:00:41.011488"]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image", nil], ["updated_at", "2022-12-26 08:57:23.500633"], ["id", 2]]